package lesson2;

public class Main1 {

    public static void main(String[] args) {
        // Задача: усть число, нужно напечатать на консоль true - если чётное, false - если не чётное

        int number = 13;
        int ostatokDeleniyaNa2 = number % 2; // 1  0
        System.out.println(ostatokDeleniyaNa2 == 0);

    }
}
